RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/***************************************************************************//**
* \file cy_hppass.h
* \version 1.30.1
*
* Header file for the High Performance Programmable Analog Sub-System driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hppass
* \{
* The High Performance Programmable Analog Sub-System (HPPASS) PDL driver provides API to use the
* High Performance Programmable Analog Sub-System (HPPASS) HW block.
*
* \section group_hppass_glossary Glossary
* * AC - Autonomous Controller, state machine engine for High Performance Programmable Analog Sub-System
* * TC - Timer/Counter, the sub-block of the AC
* * STT - State Transition Table, the table of state machine states for High Performance Programmable Analog Sub-System,
*         essentially the 'program' for AC.
* * CSG - Comparator Slope Generator
*
********************************************************************************
* \section group_hppass_configuration Configuration Considerations
********************************************************************************
*
* In order to start the HPPASS, following functions should be called in order:
* * \ref Cy_HPPASS_Init - initializes entire HPPASS block registers, including STT,
*   SAR and CSG. Refer to config struct \ref cy_stc_hppass_cfg_t for details.
* * \ref Cy_HPPASS_AC_Start - starts the AC, which starts the HPPASS block operation.
*   Refer to \ref group_hppass_ac for details.
*
* \note When using the HPPASS personality in the Device Configurator, the personality
* includes "Initialize During Startup" checkbox (enabled by default). When enabled,
* the \ref Cy_HPPASS_Init function will be called inside of the init_cycfg_all() function.
*
********************************************************************************
* \section group_hppass_more_information More Information
********************************************************************************
* For more information on the HPPASS peripheral, refer to the technical reference
* manual (TRM).
*
*******************************************************************************
* \section group_hppass_changelog Changelog
*******************************************************************************
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="1">1.30.1</td>
*     <td>Updated CSG documentation.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="2"> 1.30</td>
*     <td>Added \ref Cy_HPPASS_SAR_CrossTalkAdjust function.</td>
*     <td>Driver enhancement.</td>
*   </tr>
*   <tr>
*     <td>Documentation update.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="3"> 1.20</td>
*     <td>Updated \ref Cy_HPPASS_SAR_SetTempSensorCurrent function interface.</td>
*     <td>Usability improvement.</td>
*   </tr>
*   <tr>
*     <td>Updated \ref Cy_HPPASS_TEMP_Calc function input parameters range check.</td>
*     <td>Defect fixing.</td>
*   </tr>
*   <tr>
*     <td>Documentation update.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="4"> 1.10</td>
*     <td>Added personality DRCs.</td>
*     <td>Defect fixing.</td>
*   </tr>
*   <tr>
*     <td>Fixed offset calculation for Cy_HPPASS_SAR_CountsTo_Volts function.</td>
*     <td>Defect fixing.</td>
*   </tr>
*   <tr>
*     <td>Added \ref Cy_HPPASS_SetFwTriggerPulse, \ref Cy_HPPASS_SetFwTriggerLevel,
*         and \ref Cy_HPPASS_ClearFwTriggerLevel functions.</td>
*     <td>Driver enhancement.</td>
*   </tr>
*   <tr>
*     <td>Documentation update.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="1">1.0</td>
*     <td>Initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_hppass_common Common
* \{
*   \defgroup group_hppass_macros Macros
*   \{
*     \defgroup group_hppass_triggers_indexes Trigger Indexes
*     \defgroup group_hppass_triggers_out_level_masks Trigger Out Level Masks
*     \defgroup group_hppass_triggers_masks Trigger Masks
*     \defgroup group_hppass_interrupts Interrupt Masks
*   \}
*   \defgroup group_hppass_functions Functions
*   \{
*     \defgroup group_hppass_cfg_functions Static configuration functions
*     \defgroup group_hppass_rt_functions Runtime operations functions
*   \}
*   \defgroup group_hppass_data_structures Data Structures
*   \defgroup group_hppass_enums Enumerated Types
* \}
* \defgroup group_hppass_ac     AC (Autonomous Controller)
* \defgroup group_hppass_csg    CSG (Comparator Slope Generator)
* \defgroup group_hppass_sar    SAR (Successive-Approximation Register Analogue to Digital Converter)
*/

#if !defined(CY_HPPASS_H)
#define CY_HPPASS_H

#include "cy_device.h"

#ifdef CY_IP_MXS40MCPASS

#include "cy_hppass_ac.h"
#include "cy_hppass_csg.h"
#include "cy_hppass_sar.h"
#include "cy_syspm.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_hppass_macros
* \{
*/

#define CY_HPPASS_TRIG_NUM                (8U)  /**< The number of triggers */

#define CY_HPPASS_DEINIT                  (0UL) /**< De-init value for most HPPASS registers */
#define CY_HPPASS_CLK_STARTUP_DIV_DEINIT  (7UL) /**< De-init value for CLOCK_STARTUP_DIV register */
/** \} group_hppass_macros */

/** \addtogroup group_hppass_triggers_indexes
 *  To be used with \ref Cy_HPPASS_TriggerInConfig,
 *                  \ref Cy_HPPASS_TriggerOutLevelConfig,
 *                  \ref Cy_HPPASS_TriggerOutPulseConfig
 *   \{
 */
#define CY_HPPASS_TRIG_0_IDX (0U) /**< Trigger #0 index */
#define CY_HPPASS_TRIG_1_IDX (1U) /**< Trigger #1 index */
#define CY_HPPASS_TRIG_2_IDX (2U) /**< Trigger #2 index */
#define CY_HPPASS_TRIG_3_IDX (3U) /**< Trigger #3 index */
#define CY_HPPASS_TRIG_4_IDX (4U) /**< Trigger #4 index */
#define CY_HPPASS_TRIG_5_IDX (5U) /**< Trigger #5 index */
#define CY_HPPASS_TRIG_6_IDX (6U) /**< Trigger #6 index */
#define CY_HPPASS_TRIG_7_IDX (7U) /**< Trigger #7 index */
/** \} group_hppass_triggers_indexes */

/** \addtogroup group_hppass_triggers_out_level_masks
 *  To be used with \ref Cy_HPPASS_TriggerOutLevelConfig
 *   \{
 */
#define CY_HPPASS_TRIG_CMP_0         (0x01) /**< CSG comparator #0 output mask */
#define CY_HPPASS_TRIG_CMP_1         (0x02) /**< CSG comparator #1 output mask */
#define CY_HPPASS_TRIG_CMP_2         (0x04) /**< CSG comparator #2 output mask */
#define CY_HPPASS_TRIG_CMP_3         (0x08) /**< CSG comparator #3 output mask */
#define CY_HPPASS_TRIG_CMP_4         (0x10) /**< CSG comparator #4 output mask */

#define CY_HPPASS_TRIG_SAR_LIM_0     (0x01) /**< SAR limit detector #0 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_1     (0x02) /**< SAR limit detector #1 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_2     (0x04) /**< SAR limit detector #2 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_3     (0x08) /**< SAR limit detector #3 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_4     (0x10) /**< SAR limit detector #4 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_5     (0x20) /**< SAR limit detector #5 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_6     (0x40) /**< SAR limit detector #6 output mask */
#define CY_HPPASS_TRIG_SAR_LIM_7     (0x80) /**< SAR limit detector #7 output mask */
/** \} group_hppass_triggers_out_level_masks */

