RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/** \addtogroup group_hppass_triggers_masks
 *  To be used with \ref Cy_HPPASS_SetFwTrigger,
 *                  \ref Cy_HPPASS_SetFwTriggerPulse,
 *                  \ref Cy_HPPASS_SetFwTriggerLevel,
 *                  \ref Cy_HPPASS_ClearFwTriggerLevel,
 *                  \ref Cy_HPPASS_ClearFwTrigger
 *   \{
 */
#define CY_HPPASS_TRIG_0_MSK (1U << CY_HPPASS_TRIG_0_IDX) /**< Trigger #0 mask */
#define CY_HPPASS_TRIG_1_MSK (1U << CY_HPPASS_TRIG_1_IDX) /**< Trigger #1 mask */
#define CY_HPPASS_TRIG_2_MSK (1U << CY_HPPASS_TRIG_2_IDX) /**< Trigger #2 mask */
#define CY_HPPASS_TRIG_3_MSK (1U << CY_HPPASS_TRIG_3_IDX) /**< Trigger #3 mask */
#define CY_HPPASS_TRIG_4_MSK (1U << CY_HPPASS_TRIG_4_IDX) /**< Trigger #4 mask */
#define CY_HPPASS_TRIG_5_MSK (1U << CY_HPPASS_TRIG_5_IDX) /**< Trigger #5 mask */
#define CY_HPPASS_TRIG_6_MSK (1U << CY_HPPASS_TRIG_6_IDX) /**< Trigger #6 mask */
#define CY_HPPASS_TRIG_7_MSK (1U << CY_HPPASS_TRIG_7_IDX) /**< Trigger #7 mask */
/** \} group_hppass_triggers_masks */

/** \addtogroup group_hppass_interrupts
 *  To be used with \ref Cy_HPPASS_GetInterruptStatus,
 *                  \ref Cy_HPPASS_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_ClearInterrupt,
 *                  \ref Cy_HPPASS_SetInterrupt,
 *                  \ref Cy_HPPASS_SetInterruptMask,
 *                  \ref Cy_HPPASS_GetInterruptMask
 *  \{
 */
#define CY_HPPASS_INTR_FIFO_0_OVERFLOW       (0x01UL) /**< Result interrupt mask for the FIFO #0 overflow */
#define CY_HPPASS_INTR_FIFO_1_OVERFLOW       (0x02UL) /**< Result interrupt mask for the FIFO #1 overflow */
#define CY_HPPASS_INTR_FIFO_2_OVERFLOW       (0x04UL) /**< Result interrupt mask for the FIFO #2 overflow */
#define CY_HPPASS_INTR_FIFO_3_OVERFLOW       (0x08UL) /**< Result interrupt mask for the FIFO #3 overflow */
#define CY_HPPASS_INTR_FIFO_0_UNDERFLOW      (0x10UL) /**< Result interrupt mask for the FIFO #0 underflow */
#define CY_HPPASS_INTR_FIFO_1_UNDERFLOW      (0x20UL) /**< Result interrupt mask for the FIFO #1 underflow */
#define CY_HPPASS_INTR_FIFO_2_UNDERFLOW      (0x40UL) /**< Result interrupt mask for the FIFO #2 underflow */
#define CY_HPPASS_INTR_FIFO_3_UNDERFLOW      (0x80UL) /**< Result interrupt mask for the FIFO #3 underflow */

#define CY_HPPASS_INTR_FIFO_OVERFLOW         (HPPASS_MMIO_HPPASS_INTR_FIFO_OVERFLOW_Msk) /**< FIFO overflow interrupt mask */
#define CY_HPPASS_INTR_FIFO_UNDERFLOW        (HPPASS_MMIO_HPPASS_INTR_FIFO_UNDERFLOW_Msk) /**< FIFO underflow interrupt mask */
#define CY_HPPASS_INTR_RESULT_OVERFLOW       (HPPASS_MMIO_HPPASS_INTR_RESULT_OVERFLOW_Msk) /**< Result overflow interrupt mask */
#define CY_HPPASS_INTR_GROUP_TR_COLLISION    (HPPASS_MMIO_HPPASS_INTR_ENTRY_TR_COLLISION_Msk) /**< Sequencer Group Trigger Collision interrupt mask */
#define CY_HPPASS_INTR_GROUP_HOLD_VIOLATION  (HPPASS_MMIO_HPPASS_INTR_ENTRY_HOLD_VIOLATION_Msk) /**< Sequencer Group Hold Violation interrupt mask */
#define CY_HPPASS_INTR_AC_INT                (HPPASS_MMIO_HPPASS_INTR_AC_INT_Msk) /**< Autonomous Controller interrupt mask */

/** Combined interrupt mask */
#define CY_HPPASS_INTR                 (HPPASS_MMIO_HPPASS_INTR_FIFO_OVERFLOW_Msk | \
                                        HPPASS_MMIO_HPPASS_INTR_FIFO_UNDERFLOW_Msk | \
                                        HPPASS_MMIO_HPPASS_INTR_RESULT_OVERFLOW_Msk | \
                                        HPPASS_MMIO_HPPASS_INTR_ENTRY_TR_COLLISION_Msk | \
                                        HPPASS_MMIO_HPPASS_INTR_ENTRY_HOLD_VIOLATION_Msk | \
                                        HPPASS_MMIO_HPPASS_INTR_AC_INT_Msk)
/** \} group_hppass_interrupts */

/** \cond Macros for conditions used by CY_ASSERT calls */
#define CY_HPPASS_TRIGPULSE_VALID(trigPulse)          ((CY_HPPASS_DISABLED     == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_0  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_1  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_2  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_3  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_4  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_5  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_6  == (trigPulse)) || \
                                                       (CY_HPPASS_SAR_GROUP_7  == (trigPulse)) || \
                                                       (CY_HPPASS_FIR_0        == (trigPulse)) || \
                                                       (CY_HPPASS_FIR_1        == (trigPulse)) || \
                                                       (CY_HPPASS_AC_TR        == (trigPulse)))

#define CY_HPPASS_TRIGIN_VALID(inSel)          ((CY_HPPASS_TR_DISABLED  == (inSel)) || \
                                                (CY_HPPASS_TR_HW_A      == (inSel)) || \
                                                (CY_HPPASS_TR_HW_B      == (inSel)) || \
                                                (CY_HPPASS_TR_FW_PULSE  == (inSel)) || \
                                                (CY_HPPASS_TR_FW_LEVEL  == (inSel)))

#define CY_HPPASS_TRIGHW_VALID(hwMode)         ((CY_HPPASS_PULSE_ON_POS_DOUBLE_SYNC  == (hwMode)) || \
                                                (CY_HPPASS_PULSE_ON_NEG_DOUBLE_SYNC  == (hwMode)) || \
                                                (CY_HPPASS_PULSE_ON_BOTH_DOUBLE_SYNC == (hwMode)) || \
                                                (CY_HPPASS_LEVEL_DOUBLE_SYNC         == (hwMode)) || \
                                                (CY_HPPASS_PULSE_ON_POS_SINGLE_SYNC  == (hwMode)) || \
                                                (CY_HPPASS_PULSE_ON_NEG_SINGLE_SYNC  == (hwMode)) || \
                                                (CY_HPPASS_PULSE_ON_BOTH_SINGLE_SYNC == (hwMode)) || \
                                                (CY_HPPASS_LEVEL_SINGLE_SYNC         == (hwMode)))

#define CY_HPPASS_COMPMASK_VALID(compEn)          (0U == ((compEn) & ((uint8_t) ~(CY_HPPASS_INTR_CSG_0_CMP | \
                                                                                  CY_HPPASS_INTR_CSG_1_CMP | \
                                                                                  CY_HPPASS_INTR_CSG_2_CMP | \
                                                                                  CY_HPPASS_INTR_CSG_3_CMP | \
                                                                                  CY_HPPASS_INTR_CSG_4_CMP))))
/** \endcond */

