RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_hppass_enums
* \{
*/

/** Trigger type selection */
typedef enum
{
    CY_HPPASS_TR_DISABLED = 0U, /**< Trigger is off */
    CY_HPPASS_TR_HW_A     = 1U, /**< Select an external HW trigger from A trigger inputs */
    CY_HPPASS_TR_HW_B     = 2U, /**< Select the external HW trigger from B trigger inputs */
    CY_HPPASS_TR_FW_PULSE = 3U, /**< Select FW PULSE trigger */
    CY_HPPASS_TR_FW_LEVEL = 4U, /**< Select FW LEVEL trigger */
} cy_en_hppass_trig_t;


/** HW trigger mode */
typedef enum
{
    CY_HPPASS_PULSE_ON_POS_DOUBLE_SYNC  = 0U, /**< Async in FC, double synced and converted to pulse on pos edge */
    CY_HPPASS_PULSE_ON_NEG_DOUBLE_SYNC  = 1U, /**< Async in FC, double synced and converted to sync pulse on neg edge */
    CY_HPPASS_PULSE_ON_BOTH_DOUBLE_SYNC = 2U, /**< Async in FC, double synced and converted to sync pulse on 2 edges */
    CY_HPPASS_LEVEL_DOUBLE_SYNC         = 3U, /**< Async in FC, double synced and used as a level trigger */
    CY_HPPASS_PULSE_ON_POS_SINGLE_SYNC  = 4U, /**< Sync in FC then converted to pulse on pos edge */
    CY_HPPASS_PULSE_ON_NEG_SINGLE_SYNC  = 5U, /**< Sync in FC then converted to pulse on neg edge*/
    CY_HPPASS_PULSE_ON_BOTH_SINGLE_SYNC = 6U, /**< Sync in FC then converted to pulse on 2 edges */
    CY_HPPASS_LEVEL_SINGLE_SYNC         = 7U, /**< Async in FC, used as a level trigger */
} cy_en_hppass_trig_hw_t;


/** PULSE trigger out select */
typedef enum
{
    CY_HPPASS_DISABLED    = 0U,  /**< Disable trigger output */
    CY_HPPASS_SAR_GROUP_0 = 1U,  /**< Enable the SAR Sequencer Group 0 Done trigger output */
    CY_HPPASS_SAR_GROUP_1 = 2U,  /**< Enable the SAR Sequencer Group 1 Done event trigger output */
    CY_HPPASS_SAR_GROUP_2 = 3U,  /**< Enable the SAR Sequencer Group 2 Done event trigger output */
    CY_HPPASS_SAR_GROUP_3 = 4U,  /**< Enable the SAR Sequencer Group 3 Done event trigger output */
    CY_HPPASS_SAR_GROUP_4 = 5U,  /**< Enable the SAR Sequencer Group 4 Done event trigger output */
    CY_HPPASS_SAR_GROUP_5 = 6U,  /**< Enable the SAR Sequencer Group 5 Done event trigger output */
    CY_HPPASS_SAR_GROUP_6 = 7U,  /**< Enable the SAR Sequencer Group 6 Done event trigger output */
    CY_HPPASS_SAR_GROUP_7 = 8U,  /**< Enable the SAR Sequencer Group 7 Done event trigger output */
    CY_HPPASS_FIR_0       = 9U,  /**< Enable the FIR 0 Done event trigger output */
    CY_HPPASS_FIR_1       = 10U, /**< Enable the FIR 1 Done event trigger output */
    CY_HPPASS_AC_TR       = 11U, /**< Enable AC trigger output */
} cy_en_hppass_trig_out_pulse_t;


/** \} group_hppass_enums */

/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_hppass_data_structures
* \{
*/

/** HW input trigger configuration structure */
typedef struct
{
    cy_en_hppass_trig_t      type; /**< Trigger type selection */
    cy_en_hppass_trig_hw_t hwMode; /**< HW trigger mode */
} cy_stc_hppass_trig_in_t;


/** Output Level Trigger configuration structure */
typedef struct
{
    bool  syncBypass; /**< LEVEL trigger operation type */
    uint8_t  compMsk; /**< Comparator mask, each bit represents separate CSG comparator output,
                       *   all selected outputs are then combined (ORed) together and
                       *   routed to associated trigger output
                       */
    uint8_t limitMsk; /**< SAR limit detector mask, each bit represents separate SAR limit detector output,
                       *   all selected outputs are then combined (ORed) together and
                       *   routed to associated trigger output
                       */
} cy_stc_hppass_trig_out_level_t;


/**
* Configuration structure to set up the entire High Performance Programmable Analog Sub-System
* to be used with \ref Cy_HPPASS_Init.
*/
typedef struct
{
    cy_stc_hppass_ac_t                                        ac; /**< Autonomous Controller */
    cy_stc_hppass_csg_t const                              * csg; /**< Pointer to the CSG configuration structure.
                                                                   *   Can be NULL if CSG is not used.
                                                                   */
    cy_stc_hppass_sar_t const                              * sar; /**< Pointer to the SAR configuration structure.
                                                                   *   Can be NULL if SAR is not used.
                                                                   */
    cy_stc_hppass_trig_in_t           trigIn[CY_HPPASS_TRIG_NUM]; /**< Array of Input Triggers */
    cy_en_hppass_trig_out_pulse_t  trigPulse[CY_HPPASS_TRIG_NUM]; /**< Array of Output Pulse Triggers */
    cy_stc_hppass_trig_out_level_t trigLevel[CY_HPPASS_TRIG_NUM]; /**< Array of Output Level Triggers */
} cy_stc_hppass_cfg_t;


/** \} group_hppass_data_structures */


/***************************************
*        Function Prototypes
***************************************/

/** \addtogroup group_hppass_cfg_functions
*   \{ */

/*******************************************************************************
* Function Name: Cy_HPPASS_Init
****************************************************************************//**
*
* Configures the entire HPPASS block including AC, STT, CSG and SAR according to the
* provided settings.
*
* \note If AC is running or SAR or CSG is already enabled, the initialization of
* the overall HPPASS is not allowed (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
* The only way to reinitialize the entire HPPASS is only after \ref Cy_HPPASS_DeInit call.
* Despite the 'block ready' status, the particular SAR or SCG subsystem,
* which is not running at the moment, can be reinitialized using
* \ref Cy_HPPASS_SAR_Init or \ref Cy_HPPASS_CSG_Init.
*
* \param cfg
* Pointer to structure containing configuration data
* for the entire High Performance Programmable Analog Sub-System, \ref cy_stc_hppass_cfg_t.
* The pointer cannot be NULL.
*
* \return
* Combined value of all the subsystem statuses, \ref cy_en_hppass_status_t.
*
* \funcusage
* \snippet test_apps/hppass_sar_fir/main.c SNIPPET_HPPASS_INIT_CFG
* \snippet test_apps/hppass_sar_fir/main.c SNIPPET_HPPASS_INIT
*
*******************************************************************************/
cy_rslt_t Cy_HPPASS_Init(const cy_stc_hppass_cfg_t * cfg);


