RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/*******************************************************************************
* Function Name: Cy_HPPASS_DeInit
****************************************************************************//**
*
* De-initializes the AC, STT, AREF, SAR, CSG,
* and triggers register values to default.
*
* \note This function stops and shuts down entire HPPASS including all the trims,
* calibrations, resets AC and STT flow and subsystems.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_DE_INIT
*
*******************************************************************************/
void Cy_HPPASS_DeInit(void);


/*******************************************************************************
* Function Name: Cy_HPPASS_DeepSleepCallback
****************************************************************************//**
*
* DeepSleep callback saves the SAR ADC calibration values before switch to
* deep sleep power mode and restore them after the wakeup.
*
* \param callbackParams
* Callback parameters, see \ref cy_stc_syspm_callback_params_t
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_DEEP_SLEEP_CLBK
*
*******************************************************************************/
cy_en_syspm_status_t Cy_HPPASS_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);


/** \cond Internal Trigger-related  macros */
#define CY_HPPASS_TRIG_IDX_VALID(trigIdx)      (CY_HPPASS_TRIG_7_IDX >= (trigIdx))
#define CY_HPPASS_TRIG_IN_BIT_POS(trigIdx)  (4UL * ((uint32_t)trigIdx)) /**< 4 is a width of TRIG_IN_SEL bitfield */
#define CY_HPPASS_TRIG_IN_BIT_VAL(val, trigIdx) ((val) << (CY_HPPASS_TRIG_IN_BIT_POS(trigIdx))) /**< Bitfield value calculation */
/** \endcond */


/*******************************************************************************
* Function Name: Cy_HPPASS_TriggerInConfig
****************************************************************************//**
*
* Sets the input trigger type and operation mode.
*
* \param trigIdx
* Trigger index.
* See \ref group_hppass_triggers_indexes.
*
* \param trig
* Pointer to the input trigger structure.
* See \ref cy_stc_hppass_trig_in_t. The pointer cannot be NULL.
*
* \return
* Status of operation, \ref cy_en_hppass_status_t.
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_TRIG_IN_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_TriggerInConfig(uint8_t trigIdx, const cy_stc_hppass_trig_in_t * trig)
{
    cy_en_hppass_status_t result = Cy_HPPASS_AC_CondRunCheck();

    CY_ASSERT_L3(CY_HPPASS_TRIGIN_VALID(trig->type));
    CY_ASSERT_L3(CY_HPPASS_TRIGHW_VALID(trig->hwMode));

    if ((NULL != trig) && (CY_HPPASS_TRIG_IDX_VALID(trigIdx)))
    {
        uint32_t trInSel_Pos = CY_HPPASS_TRIG_IN_BIT_POS(trigIdx);
        uint32_t trInSel_Msk = CY_HPPASS_TRIG_IN_BIT_VAL(HPPASS_INFRA_TR_IN_SEL_TR0_SEL_Msk, trigIdx);
        uint32_t trInMode_Pos = CY_HPPASS_TRIG_IN_BIT_POS(trigIdx);
        uint32_t trInMode_Msk = CY_HPPASS_TRIG_IN_BIT_VAL(HPPASS_INFRA_HW_TR_MODE_HW_TR0_MODE_Msk, trigIdx);

        CY_REG32_CLR_SET(HPPASS_INFRA_TR_IN_SEL(HPPASS_BASE), trInSel, trig->type);
        CY_REG32_CLR_SET(HPPASS_INFRA_HW_TR_MODE(HPPASS_BASE), trInMode, trig->hwMode);
    }
    else
    {
        result = CY_HPPASS_BAD_PARAM;
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_TriggerOutLevelConfig
****************************************************************************//**
*
* Sets the LEVEL trigger output configuration.
*
* \param trigIdx
* Trigger index.
* See \ref group_hppass_triggers_indexes.
*
* \param trig
* Pointer to the output LEVEL trigger structure.
* See \ref cy_stc_hppass_trig_out_level_t. The pointer cannot be NULL.
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_TRIG_OUT_LEVEL_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_TriggerOutLevelConfig(uint8_t trigIdx, const cy_stc_hppass_trig_out_level_t * trig)
{
    cy_en_hppass_status_t result = Cy_HPPASS_AC_CondRunCheck();

    if (CY_HPPASS_TRIG_IDX_VALID(trigIdx) &&
        (NULL != trig) &&
        CY_HPPASS_COMPMASK_VALID(trig->compMsk))
    {
        uint32_t trLevelCfg_Pos = trigIdx;
        uint32_t trLevelCfg_Msk = 1UL << trLevelCfg_Pos;

        CY_REG32_CLR_SET(HPPASS_MMIO_TR_LEVEL_CFG(HPPASS_BASE), trLevelCfg, trig->syncBypass);
        HPPASS_MMIO_TR_LEVEL_OUT(HPPASS_BASE, trigIdx) = _VAL2FLD(HPPASS_MMIO_TR_LEVEL_OUT_CMP_TR, trig->compMsk) |
                                                         _VAL2FLD(HPPASS_MMIO_TR_LEVEL_OUT_SAR_RANGE_TR, trig->limitMsk);
    }
    else
    {
        result = CY_HPPASS_BAD_PARAM;
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_TriggerOutPulseConfig
****************************************************************************//**
*
* Sets the PULSE trigger output configuration.
*
* \param trigIdx
* Trigger index.
* See \ref group_hppass_triggers_indexes.
*
* \param trig
* The PULSE trigger out select.
* See \ref cy_en_hppass_trig_out_pulse_t.
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_TRIG_OUT_PULSE_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_TriggerOutPulseConfig(uint8_t trigIdx, cy_en_hppass_trig_out_pulse_t trig)
{
    cy_en_hppass_status_t result = Cy_HPPASS_AC_CondRunCheck();

    CY_ASSERT_L3(CY_HPPASS_TRIGPULSE_VALID(trig));

    if (CY_HPPASS_TRIG_IDX_VALID(trigIdx))
    {
        HPPASS_MMIO_TR_PULSE_OUT(HPPASS_BASE, trigIdx) = _VAL2FLD(HPPASS_MMIO_TR_PULSE_OUT_SEL, trig);
    }
    else
    {
        result = CY_HPPASS_BAD_PARAM;
    }

    return result;
}

/** \} group_hppass_cfg_functions */


/** \addtogroup group_hppass_rt_functions
*   \{ */


