RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/*******************************************************************************
* Function Name: Cy_HPPASS_GetInterruptStatus
****************************************************************************//**
*
* Returns the interrupt register status.
*
* \return
* The status of combined interrupt requests \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_ISR
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_GetInterruptStatus(void)
{
    return HPPASS_MMIO_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt for High Performance Programmable Analog Sub-System.
*
* \param interrupt
* The mask of interrupts to clear. Each bit of this mask is responsible for
* clearing of the particular interrupt \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_ISR
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR));

    HPPASS_MMIO_INTR(HPPASS_BASE) = CY_HPPASS_INTR & interrupt;

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_MMIO_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the High Performance Programmable Analog Sub-System.
*
* \param interrupt
* The mask of interrupts to set. Each bit of this mask is responsible for
* triggering of the particular interrupt \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_SET_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR));

    HPPASS_MMIO_INTR_SET(HPPASS_BASE) = CY_HPPASS_INTR & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SetInterruptMask
****************************************************************************//**
*
* Configures which bits of the interrupt request register will trigger
* an interrupt event in the High Performance Programmable Analog Sub-System.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_SET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR));

    HPPASS_MMIO_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask. Each bit of this mask allows triggering of
* the particular interrupt in the High Performance Programmable Analog Sub-System.
*
* \return
* The mask of the interrupts allowable for activation \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_GET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_GetInterruptMask(void)
{
    return HPPASS_MMIO_INTR_MASK(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the result of the bitwise AND operation between the
* corresponding interrupt request and mask bits.
* See \ref Cy_HPPASS_GetInterruptStatus and \ref Cy_HPPASS_SetInterruptMask.
*
* \return
* The masked status of combined interrupt requests \ref group_hppass_interrupts.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_ISR
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_GetInterruptStatusMasked(void)
{
    return HPPASS_MMIO_INTR_MASKED(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SetFwTriggerPulse
****************************************************************************//**
*
* Generates FW Pulse trigger if according configuration done in
* Cy_HPPASS_TriggerInConfig().
*
* \param mask
* Trigger mask.
* See \ref group_hppass_triggers_masks.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SetFwTriggerPulse(uint8_t mask)
{
    HPPASS_INFRA_FW_TR_PULSE(HPPASS_BASE) = (uint32_t)mask;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SetFwTriggerLevel
****************************************************************************//**
*
* Generates FW Level trigger if according configuration done in
* Cy_HPPASS_TriggerInConfig().
*
* \param mask
* Trigger mask.
* See \ref group_hppass_triggers_masks.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SetFwTriggerLevel(uint8_t mask)
{
    HPPASS_INFRA_FW_TR_LEVEL(HPPASS_BASE) |= (uint32_t)mask;
}


