RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SetFwTrigger
****************************************************************************//**
*
* Generates FW trigger, Pulse or Level, depends on configuration in
* Cy_HPPASS_TriggerInConfig().
*
* \param mask
* Trigger mask.
* See \ref group_hppass_triggers_masks.
*
* \return
* Status of operation, \ref cy_en_hppass_status_t.
*
* \funcusage
* \snippet test_apps/hppass_common/main.c SNIPPET_HPPASS_SET_FW_TRIG
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_SetFwTrigger(uint8_t mask);


/*******************************************************************************
* Function Name: Cy_HPPASS_ClearFwTriggerLevel
****************************************************************************//**
*
* Clears the firmware Level trigger.
*
* \param mask
* Trigger mask.
* See \ref group_hppass_triggers_masks.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_ClearFwTriggerLevel(uint8_t mask)
{
    HPPASS_INFRA_FW_TR_LEVEL(HPPASS_BASE) &= ~(uint32_t)mask;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_ClearFwTrigger
****************************************************************************//**
*
* Clears the firmware trigger.
*
* \param mask
* Trigger mask.
* See \ref group_hppass_triggers_masks.
*
* \return
* Status of operation, \ref cy_en_hppass_status_t.
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_CLR_FW_TRIG
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_ClearFwTrigger(uint8_t mask);


/*******************************************************************************
* Function Name: Cy_HPPASS_IsVddaOk
****************************************************************************//**
*
* Returns the VDDA voltage status.
*
* \return
* VDDA status: true - VDDA is at or above minimum threshold,
*              false - VDDA is below minimum threshold.
*
* \funcusage
* \snippet hppass/snippet/hppass_common.c SNIPPET_HPPASS_IS_VDDA_OK
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_IsVddaOk(void)
{
    return _FLD2BOOL(HPPASS_INFRA_VDDA_STATUS_VDDA_OK, HPPASS_INFRA_VDDA_STATUS(HPPASS_BASE));
}

/** \} group_hppass_rt_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40MCPASS */

#endif /** !defined(CY_HPPASS_H) */

/** \} group_hppass */

/* [] END OF FILE */
